{
  "proposito": "Orientar a equipe sobre como escrever mensagens de commit seguindo o padrão Conventional Commits.",
  "estrutura_basica": "<tipo>(escopo opcional): <resumo>",
  "regras": [
    "Use apenas letras minúsculas para o tipo e o escopo.",
    "O resumo deve ser curto (máximo de 72 caracteres) e no modo imperativo.",
    "Separe linhas adicionais com uma linha em branco após o resumo.",
    "Inclua BREAKING CHANGE na seção de corpo ou rodapé quando houver alterações incompatíveis."
  ],
  "tipos_de_commit": {
    "feat": "Adiciona uma nova funcionalidade.",
    "fix": "Corrige um problema ou bug.",
    "docs": "Atualiza ou adiciona documentação.",
    "style": "Mudança que não afeta o comportamento (formatação, espaços, etc.).",
    "refactor": "Refatora código sem corrigir bugs nem adicionar funcionalidades.",
    "perf": "Melhora de desempenho.",
    "test": "Adiciona ou ajusta testes.",
    "build": "Mudanças em build, dependências ou ferramentas externas.",
    "ci": "Alterações em arquivos de configuração e scripts de CI.",
    "chore": "Outras mudanças que não alteram código de produção.",
    "revert": "Reverte um commit anterior."
  },
  "corpo_e_rodape": {
    "quando_usar": [
      "Explique o motivo da mudança quando não estiver claro no resumo.",
      "Liste impactos, dependências ou referências importantes.",
      "Inclua BREAKING CHANGE: <descrição> quando existir quebra de compatibilidade."
    ],
    "referencias": [
      "Relacione issues com palavras-chave como Closes #123 ou Related-to #456.",
      "Inclua links relevantes se necessários."
    ]
  },
  "passo_a_passo": [
    "Analise a alteração e identifique o tipo adequado.",
    "Defina um resumo conciso no modo imperativo.",
    "Adicione corpo e rodapé apenas se agregarem contexto.",
    "Revise a mensagem antes de confirmar o commit."
  ],
  "exemplos": [
    {
      "cenario": "Nova funcionalidade",
      "commit": "feat(auth): permitir login com OAuth"
    },
    {
      "cenario": "Correção de bug",
      "commit": "fix(api): corrigir erro de timeout ao consultar pedidos"
    },
    {
      "cenario": "Mudança incompatível",
      "commit": "feat(api)!: atualizar contrato de resposta de pedidos",
      "corpo": "BREAKING CHANGE: Campos antigos foram removidos e substituídos por novos identificadores."
    }
  ],
  "referencias_adicionais": [
    "https://www.conventionalcommits.org/pt-br/v1.0.0/"
  ]
}
